app/Controllers/Author.php

SELECT *
FROM `author`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `author`
---
    public function index()
    {
        $pager = \Config\Services::pager();
        $currentPage = $this->request->getVar('page_author') ? $this->request->getVar('page_author') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $author = $this->author->search($keyword);
        } else {
            $author = $this->author;
        }

        $data = [
            'author'   => $author->paginate(5, 'author'),
            'pager'         => $this->author->pager,
            'currentPage'   => $currentPage
        ];