app/Controllers/Webnovel.php

SELECT *
FROM `webnovel`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `webnovel`
---
    public function index()
    {
        $pager = \Config\Services::pager();
        $currentPage = $this->request->getVar('page_webnovel') ? $this->request->getVar('page_webnovel') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $web = $this->webnovel->search($keyword);
        } else {
            $web = $this->webnovel;
        }

        $data = [
            'webnovel'   => $this->webnovel->paginate(5, 'webnovel'),
            'pager'         => $this->webnovel->pager,
            'currentPage'   => $currentPage
        ];